v2/app/controllers/events_controller.rb

SELECT "events".* FROM "events" INNER JOIN "access_point_sightings" ON access_point_sightings.event_id = events.id WHERE (((events.id != 366) AND ("events"."type" IN (E'SweepOut',E'SweepIn'))) AND ((access_point_sightings.bssid IN (E'00:18:f8:62:03:b1',E'00:1e:69:e6:2b:69',E'02:1e:69:e6:2b:6a',E'00:24:17:b0:36:23',E'00:1b:2f:5b:83:2a',E'00:1f:9f:cd:71:63',E'00:1c:df:76:56:7d',E'00:24:17:b8:d5:ed',E'00:15:e9:0a:e0:24')) AND ((events.starting_at, events.ending_at) OVERLAPS (timestamp '2010-07-12 11:05:07.254570', timestamp '2010-07-12 11:05:14.254684'))))
INSERT INTO "events" ("ending_at", "model", "brand", "device", "latitude", "created_at", "event_group_id", "network_type", "timestamp", "uuid", "updated_at", "network_operator", "client_uuid", "point", "location_accuracy", "hoccability", "type", "pairing_mode", "manufacturer", "longitude", "user_agent", "starting_at", "local_ip", "api_version", "state", "version_sdk") VALUES('2010-07-13 10:22:22.829206', E'Droid', E'verizon', E'sholes', 40.0375291, '2010-07-13 10:22:15.829328', NULL, E'EVDO_A', E'1279013656407', E'6ecca6207096012d8d7e001f5bf1b5ba', '2010-07-13 10:22:15.829328', E'Verizon Wireless', E'4305657b-1bea-46f2-8255-ce3168ab2a14', E'0101000020E6100000DE1DB723CD8F52C0FC92E8C0CD044440', 49.0, E'3', E'Catch', NULL, E'Motorola', -74.2468957222222, NULL, '2010-07-13 10:22:15.829119', E'192.168.1.4', 2, E'waiting', E'7') RETURNING "id"
---
  def create
    legacy_client = convert_legacy_params # TODO remove Legacy

    unless legacy_client
      valid_columns = Event.column_names
      valid_columns += ["bssids", "lifetime"]
      params[:event].delete_if do |k,v|
        not valid_columns.include?( k )
      end
    end

    convert_bssid_params
    params[:event].merge! :user_agent => request.user_agent

    begin
      event_type  = params[:event].delete(:type)
      base        = Event.const_get(event_type.camelize)
      @event      = base.new params[:event]
    rescue
      render :text => "Bad Event Type", :status => 400
    end

    if @event.save

SELECT * FROM "events" WHERE ("events"."uuid" = E'822825b065a4012d361200176ed99fe3') LIMIT 1
---
  def show
    @event = Event.find_by_uuid( params[:id] )

SELECT * FROM "events" WHERE ("events"."uuid" = E'c53931406fd4012d8d7d001f5bf1b5ba') LIMIT 1
UPDATE "events" SET "updated_at" = '2010-07-12 11:15:59.739247', "state" = E'canceled' WHERE "id" = 412
---
  def destroy
    if @event = Event.find_by_uuid( params[:id] )
      @event.update_attributes( :state => "canceled", :event_group_id => nil )