app/controllers/gestures_controller.rb

  def create
    host = "#{request.protocol}#{request.env["HTTP_HOST"]}"

    location = Location.create_from(params[:location_id])
    gesture =  Gesture.create!(params[:gesture])
    location.gestures << gesture

    sha = SHA1.new(
      location_gesture_url(
        :id   => gesture.id,
        :location_id  => location.serialized_coordinates
      ) + Time.now.to_s
    ).to_s

    upload = Upload.create(:checksum => sha)
    gesture.upload = upload
    upload.save
---
INSERT INTO "locations" ("latitude", "created_at", "accuracy", "updated_at", "longitude") VALUES(13.0, '2009-07-03 09:10:31', 42.0, '2009-07-03 09:10:31', 52.0)
INSERT INTO "gestures" ("name", "created_at", "updated_at", "location_id") VALUES('throw', '2009-07-03 09:15:48', '2009-07-03 09:15:48', NULL)
UPDATE "gestures" SET "location_id" = 996332878, "updated_at" = '2009-07-03 09:16:04' WHERE "id" = 996332878