app/controllers/uploads_controller.rb

UPDATE "uploads" SET "updated_at" = '2010-08-13 10:28:22.727556', "attachment_file_size" = 0, "attachment_updated_at" = '2010-08-13 10:28:22.725963', "attachment_content_type" = 'image/png', "attachment_file_name" = 'upload.png20100813-36440-13pnk4k' WHERE "id" = 765699
---
  def update
    upload = Upload.find_by_uid params[:id]

    upload.update_attributes( params[:upload] )